tutorials/YouTube-Tutorials-master/multiRegionTutorial/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Heater
    {
        name    heaterCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box  (-0.11 -0.041  -0.055)(0.11 -0.021 0.055); // box1 
        }
    }

    {
        name    heaterCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box (-0.11 0.019  -0.055)(0.11 0.041 0.055); // box 2
        }
    }

    {
        name    heater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set heaterCellSet;
        }
    }


    {
        name    heaterCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    water;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set heaterCellSet;
        }
    }


);


// ************************************************************************* //
